---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.GetTransparency
source: html/f8895d40-ca5e-5092-766b-4ad6150926f7.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.GetTransparency Method

Gets the transparency value of the handle and the associated DirectContext3D graphics.

## Syntax (C#)
```csharp
public int GetTransparency()
```

## Returns
The transparency value (in percentage)